tariff_text = (
    """
    <b>📢 Хотим уведомить Вас, что наша компания осуществляет доставку из-за рубежа.</b>\n
    Мы можем поставлять для Вас коммерческие партии и документы из <b>25 стран</b> нашего присутствия.\n
    \n<b>❓ Почему именно мы?</b>\n • ⏱️ <b>Оперативное предоставление обратной связи.</b>\n После поступления Вашей заявки менеджер в течение <b>24 часов</b> обработает её и свяжется с Вами для консультации.\n
    \n• 🤝 <b>Персональное сопровождение.</b>\n
    Закрепленный менеджер будет с Вами на всем пути заказа: от момента заполнения документов до вручения посылки.\n
    \n• 💰 <b>Выгодные тарифы.</b>\n
    Мы понимаем, насколько важен материальный вопрос в нынешних условиях, поэтому разработали тарифы, максимально выгодные для наших клиентов.\n
    \n<b>🌍 Страны нашего присутствия:</b>\n
    США, Англия, Португалия, Испания, Финляндия, Италия, Азербайджан, Грузия, Узбекистан, Турция, ОАЭ, Вьетнам, Израиль, Польша, Франция, Китай, Германия, Южная Корея, Казахстан, Беларусь, Кыргызстан, Абхазия.\n
    Если Вас заинтересовал один из тарифов или услуг и остались вопросы:\n
    📞 <b>Прошу обращаться по номеру:</b> +7 951 305-30-36 — Отдел сопровождения\n
    💬 Или всегда можешь написать в Telegram @CDEK48.
    """
)
